.config/emacs/Semacs/config.org
#+Title: Semacs Config V.3
#+AUTHOR: Sean Averhoff
#+CREATED: [2021-04-21 Wed 23:58]
#+LAST_MODIFIED: [2021-04-21 Wed 23:58]
#+STARTUP: OVERVIEW
#+ROAM_ALIAS:
#+ROAM_TAGS:
#+Setupfile: ~/Coding/elisp/Semacs/straight/repos/org-exsty/styles-html/readtheorg_inline.theme

* Initialize-Settings
** Semacs-Version
#+begin_src emacs-lisp
(defconst semacs-version "1.0.3"
  "Current version of Semacs.")
#+end_src

** Directory-Variables
#+begin_src emacs-lisp
(defun setup-load-path ()
  (defconst semacs-emacs-dir user-emacs-directory
    "The path to the currently loaded .emacs.d directory. Must end with a slash.")

  (defconst semacs-core-dir (concat semacs-emacs-dir "core/")
    "The root directory of Semacs's core files. Must end with a slash.")

  (defconst semacs-modules-dir (concat semacs-emacs-dir "modules/")
    "The root directory for Semacs's modules. Must end with a slash.")

  (defconst semacs-private-dir (concat semacs-emacs-dir "config/")
    "Where your private configuration is placed.")

  (defconst semacs-local-dir (concat semacs-emacs-dir ".local/")
	  "Root directory for local storage.")

  (defconst semacs-cache-dir (concat semacs-emacs-dir ".local/cache/")
    "Directory for volatile local storage.
     Use this for files that change often, like cache files. Must end with a slash.")

  (defconst semacs-etc-dir (concat semacs-emacs-dir ".local/etc/")
	 "Directory for non-volatile local storage.
    Use this for files that don't change much, like server binaries, external
    dependencies or long-term shared data. Must end with a slash.")

  (defconst semacs-docs-dir (concat semacs-emacs-dir "docs/")
    "Where Semacs's documentation files are stored. Must end with a slash.")

  ;; Add folders to load path
  (add-to-list 'load-path semacs-core-dir)
  (add-to-list 'load-path semacs-modules-dir)
  (add-to-list 'load-path semacs-cache-dir)
  (add-to-list 'load-path semacs-local-dir)
  (add-to-list 'load-path semacs-etc-dir)
  (add-to-list 'load-path semacs-private-dir)
  (add-to-list 'load-path semacs-docs-dir)
)

(setup-load-path)
#+end_src

** OS-Environments
Environment variables for the different OS.
#+begin_src emacs-lisp
(defconst EMACS27+   (> emacs-major-version 26))
(defconst EMACS28+   (> emacs-major-version 27))
(defconst IS-MAC     (eq system-type 'darwin))
(defconst IS-LINUX   (eq system-type 'gnu/linux))
(defconst IS-WINDOWS (memq system-type '(cygwin windows-nt ms-dos)))
(defconst IS-BSD     (or IS-MAC (eq system-type 'berkeley-unix)))
#+end_src

Unix tools look for HOME, but this is normally not defined on Windows.
#+begin_src emacs-lisp
(when (and IS-WINDOWS (null (getenv-internal "HOME")))
(setenv "HOME" (getenv "USERPROFILE"))
(setq abbreviated-home-dir nil))
#+end_src

** Coding-System
Make UTF-8 the default coding system.
#+begin_src emacs-lisp
(when (fboundp 'set-charset-priority)
  (set-charset-priority 'unicode))

(setq locale-coding-system 'utf-8)
(set-language-environment "UTF-8")
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(set-file-name-coding-system 'utf-8)
(set-clipboard-coding-system 'utf-8)
(set-buffer-file-coding-system 'utf-8)
#+end_src

** Startup-Performance
Disable warnings from legacy advice system.
#+begin_src emacs-lisp
(setq ad-redefinition-action 'accept)
#+end_src

Get rid of "Info about Emacs message at startup, unless we're in a daemon session.
#+begin_src emacs-lisp
(unless (daemonp)
  (advice-add #'display-startup-echo-area-message :override #'ignore))
#+end_src

Reduce *Message* noise at startup.
#+begin_src emacs-lisp
(setq inhibit-startup-message t
      inhibit-startup-echo-area-message user-login-name
      inhibit-default-init t
      initial-major-mode 'fundamental-mode
      initial-scratch-message nil)
#+end_src

Make startup faster by reducing the frequency of garbage collection.
#+begin_src emacs-lisp
(setq gc-cons-threshold 64000000)
#+end_src

Restore garabage collection after startup.
#+begin_src emacs-lisp
(add-hook 'after-init-hook #'(lambda ()
  (setq gc-cons-threshold 1200000)))
#+end_src

Measure startup-performace
#+begin_src emacs-lisp
(add-hook 'dashboard-after-initialize-hook
;(add-hook 'emacs-startup-hook
  (lambda ()
    (message "*** Semacs loaded in %s with %d garbage collections."
      (format "%.2f seconds"
        (float-time
        (time-subtract after-init-time before-init-time)))
      gcs-done)))
#+end_src

** Optimizations
A second, case-insensitive pass over `auto-mode-alist' is time wasted, and indicates misconfiguration (don't rely on case insensitivity for file names).
#+begin_src emacs-lisp
(setq auto-mode-case-fold nil)
#+end_src

Disable bidirectional text rendering for a modest performance boost. I've set this to `nil' in the past, but the `bidi-display-reordering's docs say that is an undefined state and suggest this to be just as good:
#+begin_src emacs-lisp
(setq-default bidi-display-reordering 'left-to-right
              bidi-paragraph-direction 'left-to-right)
#+end_src

Disabling the BPA makes redisplay faster, but might produce incorrect display reordering of bidirectional text with embedded parentheses and other bracket characters whose 'paired-bracket' Unicode property is non-nil.
#+begin_src emacs-lisp
(setq bidi-inhibit-bpa t)  ; Emacs 27 only
#+end_src

Reduce rendering/line scan work for Emacs by not rendering cursors or regions in non-focused windows.
#+begin_src emacs-lisp
(setq-default cursor-in-non-selected-windows nil)
(setq highlight-nonselected-windows nil)
#+end_src

More performant rapid scrolling over unfontified regions. May cause brief spells of inaccurate syntax highlighting right after scrolling, which should quickly self-correct.
#+begin_src emacs-lisp
(setq fast-but-imprecise-scrolling t)
#+end_src

Don't ping things that look like domain names.
#+begin_src emacs-lisp
(setq ffap-machine-p-known 'reject)
#+end_src

Resizing the Emacs frame can be a terribly expensive part of changing the font. By inhibiting this, we halve startup times, particularly when we use fonts that are larger than the system default (which would resize the frame).
#+begin_src emacs-lisp
(setq frame-inhibit-implied-resize t)
#+end_src

Emacs "updates" its ui more often than it needs to, so we slow it down slightly from 0.5s:
#+begin_src emacs-lisp
(setq idle-update-delay 1.0)
#+end_src

Font compacting can be terribly expensive, especially for rendering icon fonts on Windows. Whether disabling it has a notable affect on Linux and Mac hasn't been determined, but we inhibit it there anyway. This increases memory usage, however!
#+begin_src emacs-lisp
(setq inhibit-compacting-font-caches t)
#+end_src

Introduced in Emacs HEAD (b2f8c9f), this inhibits fontification while receiving input, which should help with performance while scrolling.
#+begin_src emacs-lisp
(setq redisplay-skip-fontification-on-input t)
#+end_src

Performance on Windows is considerably worse than elsewhere. We'll need everything we can get.
#+begin_src emacs-lisp
(when IS-WINDOWS
  (setq w32-get-true-file-attributes nil   ; decrease file IO workload
        w32-pipe-read-delay 0              ; faster ipc
        w32-pipe-buffer-size (* 64 1024))) ; read more at a time (was 4K)
#+end_src

Remove command line options that aren't relevant to our current OS; means slightly less to process at startup.
#+begin_src emacs-lisp
(unless IS-MAC   (setq command-line-ns-option-alist nil))
(unless IS-LINUX (setq command-line-x-option-alist nil))
#+end_src

** Package-Manager
Ensure that package.el is configured correctly.
#+begin_src emacs-lisp
(setq package-enable-at-startup nil)
;(setq package-user-dir (concat semacs-local-dir "elpa/"))
(setq package-user-dir "~/.dotfiles/.config/emacs/Semacs/.local/elpa/")

(require 'package)

(setq my-package-archives '(("melpa-stable" . "http://stable.melpa.org/packages/")
                            ("org" . "http://orgmode.org/elpa/")
                            ("melpa" . "https://melpa.org/packages/")))

(setq package-archives (append package-archives
                               my-package-archives))
#+end_src

Bootstrap straight.el
#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src

 Replace use-package with straight-use-package
#+begin_src emacs-lisp
(straight-use-package 'use-package)
(setq straight-use-package-by-default t)
#+end_src

** Server-Settings
*** Built-In
??????
#+begin_src emacs-lisp
;(if (not server-mode)
;    (server-start nil t))
(load "server")
(unless (server-running-p) (server-start))
(if (daemonp)
    (message "Loading in the daemon!")
    (message "Loading in regular Emacs!"))
#+end_src

* User-Settings
** User-Variables
#+begin_src emacs-lisp
(setq user-full-name "Sean Avery")
(setq user-mail-address "seanavery@gmx.net")
(setq calendar-latitude 52.5)
(setq calendar-longitude 13.4)
(setq calendar-location-name "Berlin, DE")
#+end_src

Put customisation settings in a disposable custom.el
;#+begin_src emacs-lisp
(prot-emacs-builtin-package 'cus-edit
  ;; Disable the damn thing
  (setq custom-file (make-temp-file "emacs-custom-")))
;#+end_src

* Binding-Settings
** Evil
