.config/emacs/Semacs/config.org
*** Evil
#+begin_src emacs-lisp
(use-package evil
  :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-i-jump nil)
    (setq evil-move-cursor-back nil)
  :config
    (evil-mode 1)
    (setq evil-normal-state-cursor '("#c4b5f0" box))
    (setq evil-emacs-state-cursor '("orange" box))
    (setq evil-visual-state-cursor '("green" box))
    (setq evil-insert-state-cursor '("red" bar))
    (setq evil-replace-state-cursor '("yellow" bar))
    (setq evil-test-state-cursor '("black" bar))
    (setq evil-operator-state-cursor '("blue" hollow))
)

#+end_src

*** Evil-Surround
It's easiest to explain with examples. Press =cs"'= inside
#+begin_src emacs-lisp
(use-package evil-surround
  :after evil
  :config (global-evil-surround-mode))

#+end_src

*** Evil-Escape
Customizable key sequence to escape from insert state and everything else in Emacs.
#+begin_src emacs-lisp
(use-package evil-escape
  :after evil
  :config
    (evil-escape-mode t)
    (setq evil-move-cursor-back nil
          evil-escape-key-sequence "jk"
          evil-escape-delay 0.63
          evil-escape-unordered-key-sequence t))

#+end_src

*** Evil-Easymotion
With evil-easymotion you can invoke SPCj, and this plugin will put a target character on every possible position.
#+begin_src emacs-lisp
(use-package evil-easymotion
  :after evil
  :config
    (evilem-default-keybindings "ö"))

#+end_src

*** Evil-Commentary
Intends to make it easy to comment out (lines of) code.
#+begin_src emacs-lisp
(use-package evil-commentary
  :after evil
  :config (evil-commentary-mode))

#+end_src

*** Evil-Goggles
Evil-goggles-mode displays a visual hint when editing with evil.
#+begin_src emacs-lisp
(use-package evil-goggles
  :after evil
  :config
     (evil-goggles-mode)
     (evil-goggles-use-diff-faces))

#+end_src

*** Evil-Org
Provides integration between Evil and Org through various means such as contextual keybindings.
#+begin_src emacs-lisp
(use-package org-evil
   :after evil)

#+end_src

*** Evil-Collection
A collection???
#+begin_src emacs-lisp
(use-package evil-collection
   :after evil
   :custom
     (evil-collection-setup-minibuffer t)
     (evil-want-keybinding nil)
   :init
   (evil-collection-init))
#+end_src

*** Evil-Exchange
#+begin_src emacs-lisp
(use-package evil-exchange
  :after evil
  :custom
  setq evil-exchange-key (kbd "zx")
  (evil-exchange-install))

(defvar semacs-escape-hook nil
  "A hook run when C-g is pressed (or ESC in normal mode, for evil users).
More specifically, when `doom/escape' is pressed. If any hook returns non-nil,
all hooks after it are ignored.")

(defun semacs/escape (&optional interactive)
  "Run `semacs-escape-hook'."
  (interactive (list 'interactive))
  (cond ((minibuffer-window-active-p (minibuffer-window))
         ;; quit the minibuffer if open.
         (when interactive
           (setq this-command 'abort-recursive-edit))
         (abort-recursive-edit))
        ;; Run all escape hooks. If any returns non-nil, then stop there.
        ((run-hook-with-args-until-success 'doom-escape-hook))
        ;; don't abort macros
        ((or defining-kbd-macro executing-kbd-macro) nil)
        ;; Back to the default
        ((unwind-protect (keyboard-quit)
           (when interactive
             (setq this-command 'keyboard-quit))))))

#+end_src

*** Evil-Bindings
#+begin_src emacs-lisp
;; Define evil-ex-map
(define-key evil-ex-map "bb" 'helm-buffers-list)
(define-key evil-ex-map "bk" 'kill-current-buffer)
(define-key evil-ex-map "bK" 'kill-buffer)
(define-key evil-ex-map "bv" 'evil-window-vsplit)
(define-key evil-ex-map "bh" 'evil-window-split)
(define-key evil-ex-map "br" 'ssa/rotate-windows)
(define-key evil-ex-map "qr" 'restart-emacs)
(define-key evil-ex-map "qn" 'restart-emacs-start-new-emacs)

;; Evil Force Quit
(define-key evil-normal-state-map "\C-g" 'evil-force-normal-state)
(define-key evil-visual-state-map "\C-g" 'evil-exit-visual-state)
(define-key evil-insert-state-map "\C-g" 'evil-normal-state)
(define-key evil-replace-state-map "\C-g" 'evil-normal-state)
(define-key evil-ex-completion-map "\C-g" 'abort-recursive-edit)

;; Define Visual line motions outside of visual-line-mode buffers
(evil-global-set-key 'motion "j" 'evil-next-visual-line)
(evil-global-set-key 'motion "k" 'evil-previous-visual-line)

;; Text scaling
(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)

#+end_src

*** Evil-Nerd-Commenter
#+begin_src emacs-lisp
(use-package evil-nerd-commenter
  :bind ("s-/" . evilnc-comment-or-uncomment-lines))

#+end_src

** Not-Evil
There are many modes that are not centered about text-manipulation.
#+begin_src emacs-lisp
(mapc (lambda (mode)
  (evil-set-initial-state mode 'emacs))
    '(;;elfeed-show-mode
      ;;elfeed-search-mode
      calibredb-search-mode
      calibredb-show-mode
      eshell-mode
      forge-pullreq-list-mode
      forge-topic-list-mode
      dired-mode
      tide-references-mode
      image-dired-mode
      bufler-mode
      image-dired-thumbnail-mode
      eww-mode))

#+end_src

** General
*** Settings
#+begin_src emacs-lisp
(use-package general
  :config
    (general-define-key
      "C-<shift>" 'set-mark-command ;;;; DDDDDDDDDDDDDDDDDD
      "M-x" 'counsel-M-x                               ; replace default M-x with ivy backend
      "C-s" 'swiper                                    ; search for string in current buffer
      "C-;" 'flyspell-correct-wrapper                  ;
      "C-K" 'kill-dired-buffers                        ;
      "C-M-<return>" 'org-open-at-point                ; open link in org-mode
      "M-o" 'org-open-at-point                         ; open link in org-mode
      "M-s-<right>" 'buffer-flip-backward             ;
      "M-s-h" 'buffer-flip-backward             ;
      "M-s-<left>" 'buffer-flip-forward               ;
      "M-s-l" 'buffer-flip-forward               ;
      "M-s-<up>" 'semacs/move-line-up                 ;
      "M-s-k" 'semacs/move-line-up                 ;
      "M-s-<down>" 'semacs/move-line-down             ;
      "M-s-j" 'semacs/move-line-down             ;
      "<f5>" 'bufler                          ;
      "<f6>" 'clipmon-autoinsert-toggle                ;
      "<f9>" 'saa/flyspell-and-whitespace-mode
      "<f10>" 'other-window                            ;
      "M-p" 'other-window                             ;
      "M-s-<tab>" 'other-window                        ; open link in org-mode
      "C-c _" 'undo-tree-visualize                     ;
      "C-c P" 'saa/copy-file-name-to-clipboard)        ;

    (general-create-definer my-leader-def
      :keymaps 'override
      :prefix "SPC"
      :global-prefix "C-SPC"
      :prefix "SPC"))

#+end_src

#+begin_src emacs-lisp
(global-set-key (kbd "<escape>")
                 'keyboard-escape-quit)                    ;Make ESC quit prompts
#+end_src

*** Buffer
#+begin_src emacs-lisp
(my-leader-def
  :states 'normal
"b" '(:ignore t :which-key "buffer")
"b b" '(counsel-ibuffer :which-key "List all Buffers")
"b k" '(kill-current-buffer :which-key "Kill Buffer")
"b K" '(nuke-all-buffers :which-key "Kill all Buffers")
"b v" '(evil-window-vsplit :which-key "Split Window vertical")
"b V" '(dired-other-window :which-key "Dired other window")
"b h" '(evil-window-split :which-key "Split Window horizontaly")
"b r" '(semacs/rotate-windows :which-key "Rotate Windows")
"b t" '(org-roam-buffer-toggle-display :which-key "Maximze Buffer")
"b s" '(evil-save :which-key "Save Buffer")
)

#+end_src

