.config/emacs/Semacs/config.el
  "c" '(:ignore t :which-key "code")
  "c e" #'eval-last-sexp
  "c o" #'org-ctrl-c-ctrl-c
  "c l" #'ielm
  "c ö" #'elpy-shell-switch-to-shell
  "c m" #'emmet-expand-line
  "c n" '(elfeed :which-key "Elfeed")
  "c h" '(httpd-start :which-key "Web-Server")
  "c i" '(impatient-mode :which-key "Impatient-Mode")
  "c t" #'toggle-truncate-lines
  "c p" '(:ignore t :which-key "Python")
  "c p b" '(python-shell-send-buffer :which-key "Send buffer to shell")
  "c p s" '(python-shell-switch-to-shell :which-key "Open Python shell")
  "c p v" '(pyenv-activate-current-project :which-key "Activate Pyenv project")
  "c j" '(:ignore t :which-key "JS")
  "c j b" '(js-comint-send-buffer :which-key "Execute Buffer")
  "c j r" '(js-comint-send-region :which-key "Execute Region")
  "c j s" '(js-comint-send-last-sexp :which-key "Execute last Sexp")
  "c j n" '(js-comint-reset-repl :which-key "Reset Repl")
  "c j c" '(js-comint-clear :which-key "Clear Repl")
  "c j f" '(js-comint-load-file :which-key "Load Files")
  ;"c j b" '(js-comint :which-key "Execute Buffer")
)

(my-leader-def
 :states 'normal
  "d" '(:ignore t :which-key "delete")
  "d l" '(saa/delete-line :which-key "Delete line")
  "d d" '(saa/delete-whole-line :which-key "Delete line")
  "d s" '(saa/smart-delete-line :which-key "Delete line")
)

(my-leader-def
 :states 'normal
  "e" '(:ignore t :which-key "export")
  "e e" #'org-html-export-to-html
  "e m" #'org-pandoc-export-to-gfm-and-open
  "e o" #'saa/markdown-convert-buffer-to-org
)

(my-leader-def
 :states 'normal
  "f" '(:ignore t :which-key "file")
  "f c" '(connect-remote :which-key "Connect to Raspbery")
  "f C" '(copy-file :which-key "Copy file")
  "f D" '(delete-file :which-key "Delete file")
  "f f" '(dired :which-key "Dired")
  "f F" '(dired-other-window :which-key "Dired other window")
  "f o" '(crux-open-with :which-key "Open extern")
  "f P" '(semacs/visit-init.el :which-key "Open Init.el")
  "f p" '(semacs/visit-config.org :which-key "Open Init.org")
  "f r" '(helm-recentf :which-key "Recent files")
  "f R" '(crux-rename-buffer-and-file :which-key "Rename buffer and file")
  "f s" '(evil-save :which-key "Save File")
  "f s" '(save-buffer :which-key "Save file")
  "f S" '(write-file :which-key "Save file as...")
  "f r" '(counsel-recentf :which-key "Recent files")
  "f R" '(rename-file :which-key "Rename file")
  "f u" '(sudo-edit-find-file :which-key "Sudo find file")
  "f U" '(sudo-edit :which-key "Sudo edit file")
  "f v" '(crux-recentf-find-file :which-key "Recently visit file")

)

(my-leader-def
 :states 'normal
  "g" '(:ignore t :which-key "git")
  "g g"  'magit-status
  "g d"  'magit-diff-unstaged
  "g c"  'magit-branch-or-checkout
  "g l"   '(:ignore t :which-key "log")
  "g l c" 'magit-log-current
  "g l f" 'magit-log-buffer-file
  "g b"  'magit-branch
  "g P"  'magit-push-current
  "g p"  'magit-pull-branch
  "g f"  'magit-fetch
  "g F"  'magit-fetch-all
  "g r"  'magit-rebase
)

(my-leader-def
 :states 'normal
  "h" '(:ignore t :which-key "help")
  "h v" #'helpful-variable
  "h f" #'helpful-function
  "h k" #'helpful-key
  "h s" #'helpful-symbol
  "h p" #'helpful-at-point
  "h b" #'describe-bindings
  "h w" #'which-key-show-full-keymap
  "h y" '(yas-describe-tables :which-key "YaSnippet Table")
  "h a" #'apropos
  "h e" #'view-echo-area-messages
  "h F" #'describe-face
  "h K" #'describe-keymap
  "h p" #'describe-package
  "h d" '(:ignore t :which-key "define-word")
  "h d w" #'define-word
  "h d p" #'define-word-at-point
)

(my-leader-def
 :states 'normal
  "i" '(:ignore t :which-key "insert")
  "i y" #'counsel-yank-pop
  "i l" #'org-cliplink
  "i n" #'saa/insert-filename-as-heading
  "i f" #'saa/copy-file-name-to-clipboard
  "i d" '(saa/today :which-key "Insert Date")
  "i c" '(clipmon-autoinsert-toggle :which-key "Clipmon autoinsrt")
  "i p" '(popup-kill-ring :which-key "Popup Kill-Ring")
  "i k" '(browse-kill-ring :which-key "Browse Kill-Ring")
  "i r" '(org-rich-yank :which-key "Yank with Source Block")
  "i t" '(clipmon-autoinsert-toggle :which-key "Clipmon Toggle")
)

(my-leader-def
  :states 'normal
"j" '(:ignore t :which-key "dmenu")
"j j" '(dmenu-find-file :which-key "Find file")
"j f" '(dmenu-find-file :which-key "Find file")
"j k" '(dmenu-ag-in-file :which-key "Find file")
"j b" '(dmenu-switch-buffer :which-key "Find file")
"j J" '(dmenu-ag :which-key "Find file wih args")
)

(my-leader-def
 :states 'normal
  "m" '(:ignore t :which-key "macro")
  "m s" '(kmacro-start-macro :which-key "Macro Start")
  "m e" '(kmacro-end-macro :which-key "Macro End")
  "m n" '(kmacro-name-last-macro :which-key "Macro Name")
  "m u" '(kmacro-end-and-call-macro :which-key "Call Last Macro")
)

(my-leader-def
 :states 'normal
  "n" '(:ignore t :which-key "notes")
  "n e" '(elfeed :which-key "Elfeed")
  "n c" '(calibredb :which-key "Calibre")
)

(my-leader-def
 :states 'normal
  "o" '(:ignore t :which-key "org")
  "o a" #'org-agenda
  "o s" #'org-schedule
  "o n" #'org-add-note
  "o c" #'org-table-toggle-coordinate-overlays
  "o n" #'org-add-note
  "o i" #'org-toggle-inline-images
  "o t" #'org-insert-structure-template
)

(my-leader-def
 :states 'normal
  "p" '(:ignore t :which-key "project")
  "p p" #'buffer-flip-forward
  "p p" #'projectile-command-map
  "p f" '(projectile-find-file :which-key "Projectile find file")
)

(my-leader-def
 :states 'normal
  "r" '(:ignore t :which-key "roam")
  "r r" #'org-roam
  "r f" #'org-roam-find-file
  "r g" #'org-roam-graph
  "r i" #'org-roam-insert
  "r m" #'org-roam-insert-immediate
  "r l" #'org-insert-link
  "r c" #'org-cliplink
  "r n" #'saa/rename-current-buffer-file
  "r u" '(org-roam-unlinked-references :which-key "Unlineked Refernces")
  "r p" '(saa/visit-roam-zettelkasten :which-key "Roam Index")
  "r b" '(org-roam-switch-to-buffer :which-key "Roam Buffer")
  "r t" '(org-roam-buffer-toggle-display :which-key "Maximze Buffer")
)

(my-leader-def
 :states 'normal
  "s" '(:ignore t :which-key "search")
  "s s" '(swiper :which-key "Search in file")
  "s r" '(helm-org-rifle :which-key "?")
  "s h" '(helm-find :which-key "?")
  "s b" '(helm-bookmarks :which-key "Bookmark")
  "s w" '(webjump :which-key "Visit Webside")
  "s d" '(deft :which-key "Search Org-Files")
  "s a" '(evil-avy-goto-char :which-key "Avy go to Word")
  "s p" '(ripgrep-reg-exp :which-key "Search all files with ripgrep")
)

(my-leader-def
 :states 'normal
  "t" '(:ignore t :which-key "terminal")
  "t b" '(run-bash :which-key "Bash")
  "t w" '(run-cmdexe :which-key "Cmd")
  "t c" '(shell-command :which-key "Execute shell command")
  "t p" '(run-powershell :which-key "Powershell")
  "t e" '(eshell :which-key "Eshell")
  "t t" '(term :which-key "Term")
  "t s" '(shell :which-key "Shell")
)

(my-leader-def
 :states 'normal
  "v" '(:ignore t :which-key "view")
  "v t" '(counsel-load-theme :which-key "Change Theme")
  "v p" '(variable-pitch-mode :which-key "Pitch Mode")
)

(my-leader-def
 :states 'normal
  "w" '(:ignore t :which-key "writing")
  "w w" #'saa/flyspell-and-whitespace-mode
  "w c" #'flyspell-correct-wrapper
)

(my-leader-def
 :states 'normal
  "x" '(:ignore t :which-key "Music")
  "x s" '(counsel-spotify-search-track :which-key "Search Tracks")
  "x n" '(counsel-spotify-next :which-key "Next Track")
  "x p" '(counsel-spotify-previous :which-key "Previous Track")
  "x t" '(counsel-spotify-toggle-play-pause :which-key "Toggle Play/Pause")
  "x t" '(counsel-spotify-play :which-key "Play Tracks")
	)

(my-leader-def
 :states 'normal
