.config/emacs/Semacs/config.org
*** Quit
#+begin_src emacs-lisp
(my-leader-def
 :states 'normal
  "q" '(:ignore t :which-key "quit")
  "q r" '(restart-emacs :which-key "Restart Emacs")
  "q n" '(restart-emacs-start-new-emacs :which-key "New Instant")
  "q q" '(evil-quit :which-key "Quit Emacs")
	)

#+end_src

* Core-Settings
** Theme-Config
*** Built-In
#+begin_src emacs-lisp
(add-to-list 'custom-theme-load-path (concat user-emacs-directory "themes/"))    ;Load the custom theme folder.
(add-to-list 'load-path (concat user-emacs-directory "themes/"))           ;Some themes have several variations and share code between elisp modules these modules need to be on the load path so that these themes work
(setq custom-safe-themes t)                                                ;Load themes withot asking
#+end_src

*** Doom-Themes
[[https://github.com/hlissner/emacs-doom-themes][Doom-Themes]] is an opinionated UI plugin and pack of themes extracted from my emacs.d, inspired by some of my favorite color themes.
#+begin_src emacs-lisp
(use-package doom-themes
  :defer
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
  (doom-themes-treemacs-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
#+end_src

*** Circadian
[[https://github.com/GuidoSchmidt/circadian.el][Circadian]] adds the functionality to switch themes at night and day.
#+begin_src emacs-lisp
(use-package circadian
  :config
  (setq circadian-themes '((:sunrise . doom-flatwhite)
                           (:sunset  . doom-dracula)))
  (circadian-setup))
#+end_src

** Frame-Config
*** Buil-In
#+begin_src emacs-lisp
(setq frame-title-format '("%b – Semacs V3"))                              ;A simple frame title
(setq icon-title-format frame-title-format)                                ;
(setq frame-resize-pixelwise t)                                            ;Don't resize the frames in steps.
(setq window-resize-pixelwise nil)                                         ;But do not resize windows pixelwise, this can cause crashes in some cases where we resize windows too quickly.
(push '(menu-bar-lines . 0)   default-frame-alist)                         ;Disable tool
(push '(tool-bar-lines . 0)   default-frame-alist)                         ;Disable menu
(push '(vertical-scroll-bars) default-frame-alist)                         ;Disable scroll-bar
(setq menu-bar-mode nil)                                                   ;Variables must be unset too, otherwise users will have to cycle them twice to re-enable them.
(setq tool-bar-mode nil)                                                  ;Variables must be unset too, otherwise users will have to cycle them twice to re-enable them.
(setq scroll-bar-mode nil)                                                 ;Variables must be unset too, otherwise users will have to cycle them twice to re-enable them.
(setq use-dialog-box nil)                                                  ;Always avoid GUI
(setq split-width-threshold 160)                                           ;Favor vertical splits over horizontal ones. Screens are usually wide.
(setq split-height-threshold nil)                                          ;Favor vertical splits over horizontal ones. Screens are usually wide.
(setq ring-bell-function #'ignore)                                           ;Ring and visibel Bell
(setq visible-bell nil)                                                    ;;
(set-frame-parameter (selected-frame) 'alpha '(100 100))                   ;Change the frame transperency.
(add-to-list 'default-frame-alist '(alpha 100 100))                        ;Change the frame transperency.
(setq window-divider-default-places t)                                     ;The native border "consumes" a pixel of the fringe on righter-most splits, window-divider" does not.
(setq window-divider-default-bottom-width 1)
(setq window-divider-default-right-width 1)
(setq mouse-yank-at-point t)                                               ;Middle-click paste at point, not at click
(add-hook 'doom-init-ui-hook #'window-divider-mode)
(when (bound-and-true-p tooltip-mode)                                      ;Don't display floating tooltips; display their contents in the echo-area, because native tooltips are ugly.
  (tooltip-mode -1))
(when IS-LINUX
  (setq x-gtk-use-system-tooltips nil))
;(setq initial-frame-alist '((left . .0)                                   ;Change the inital frame size.
;                            (width . 105)
;                            (fullscreen . fullheight)))

;;; Frame-Marginr
(setq-default left-margin-width 1 right-margin-width 1)
(set-window-buffer nil (current-buffer))
#+end_src

*** All-The-Icons
#+begin_src emacs-lisp
(use-package all-the-icons
  :commands (all-the-icons-octicon
             all-the-icons-faicon
             all-the-icons-fileicon
             all-the-icons-wicon
             all-the-icons-material
             all-the-icons-alltheicon)
  :preface
  (setq doom-unicode-extra-fonts
        (list "Weather Icons"
              "github-octicons"
              "FontAwesome"
              "all-the-icons"
              "file-icons"
              "Material Icons")))

#+end_src

** Modeline-Config
*** Built-In
#+begin_src emacs-lisp
(setq display-time-day-and-date t)                                                ;Display time and date
(display-time-mode 1)                                                             ;
(setq display-time-24hr-format t)                                                 ;Enable time in the mode-line with 24h format.
(display-battery-mode 1)                                                          ;Enable battery power in the mode-line.
(setq column-number-mode t)                                                       ;Display of the current line number or column number
(minibuffer-depth-indicate-mode)                                                  ;

#+end_src

*** Doom-Modeline
[[https://github.com/seagle0128/doom-modeline][Doom-Modeline]] is a fancy and fast mode-line inspired by minimalism design.
#+begin_src emacs-lisp
(use-package doom-modeline
  :after eshell     ;; Make sure it gets hooked after eshell
  :custom
  (setq doom-modeline-height 15)
  (setq doom-modeline-bar-width 6)
  (setq doom-modeline-lsp t)
  (setq doom-modeline-github nil)
  (setq doom-modeline-mu4e nil)
  (setq doom-modeline-irc nil)
  (setq doom-modeline-minor-modes t)
  (setq doom-modeline-persp-name nil))

(add-hook 'after-init-hook #'doom-modeline-mode)

; UTF-8 don’t show in modeline unless the encoding is something different
(defun doom-modeline-conditional-buffer-encoding ()
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))
(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)

#+end_src

*** Nyan-Mode
#+begin_src emacs-lisp
(use-package nyan-mode
  :config
    (setq nyan-mode t))

#+end_src

*** Blackout
[[https://github.com/raxod502/blackout][Blackout]] is a package which allows you to hide or customize the display of major and minor modes in the mode line.
#+begin_src emacs-lisp
(straight-use-package
 '(blackout :host github :repo "raxod502/blackout"))

#+end_src

** Window-ConfigC
*** Built-In
#+begin_src emacs-lisp
(setq-default window-divider-default-right-width 3)
(setq-default window-combination-resize t)                                 ;Take new window space from all other windows (not just current)
(setq-default window-divider-default-places 'right-only)
#+end_src

