.config/emacs/Semacs/config.org
*** Ace-Window
[[https://github.com/abo-abo/ace-window][Ace-Window]] makes it possible to quickly switch windows.
#+begin_src emacs-lisp
(use-package ace-window
  :config
  ;; Show the window designators in the modeline.
  (ace-window-display-mode)

   ;; Make the number indicators a little larger. I'm getting old.
  (set-face-attribute 'aw-leading-char-face nil :height 2.0 :background "black")

  (defun my-ace-window (args)
    "As ace-window, but hiding the cursor while the action is active."
    (interactive "P")
    (cl-letf
        ((cursor-type nil)
         (cursor-in-non-selected-window nil))
      (ace-window nil)))
  :custom
  (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l) "Designate windows by home row keys, not numbers.")
  (aw-background nil))
#+end_src

*** Rotate-Window
Rotate windows.
#+begin_src emacs-lisp
(defun semacs/rotate-windows ()
  "Rotate your windows."
  (interactive)
  (cond ((not (> (count-windows)1))
         (message "You can't rotate a single window!"))
        (t
         (setq i 1)
         (setq numWindows (count-windows))
         (while  (< i numWindows)
           (let* (
                  (w1 (elt (window-list) i))
                  (w2 (elt (window-list) (+ (% i numWindows) 1)))

                  (b1 (window-buffer w1))
                  (b2 (window-buffer w2))

                  (s1 (window-start w1))
                  (s2 (window-start w2))
                  )
             (set-window-buffer w1  b2)
             (set-window-buffer w2 b1)
             (set-window-start w1 s2)
             (set-window-start w2 s1)
             (setq i (1+ i)))))))
#+end_src

*** Beacon+
Flashes the cursor's line when you scroll
#+begin_src emacs-lisp
(use-package beacon
:config
(beacon-mode 1)
; this color looks good for the zenburn theme but not for the one
 (setq beacon-color "#666600")
)
#+end_src

** Buffer-Config
*** Built-In
#+begin_src emacs-lisp
(setq uniquify-buffer-name-style 'forward)
(setq confirm-nonexistent-file-or-buffer t)                                ;Confirmation for creating a new file or buffer.
(setq-default display-line-numbers-type 'relative)

;; ...but don't do any wrapping by default. It's expensive. Enable
;; `visual-line-mode' if you want soft line-wrapping. `auto-fill-mode' for hard
;; line-wrapping.
(setq-default truncate-lines t)

;; If enabled (and `truncate-lines' was disabled), soft wrapping no longer
;; occurs when that window is less than `truncate-partial-width-windows'
;; characters wide. We don't need this, and it's extra work for Emacs otherwise,
;; so off it goes.
(setq truncate-partial-width-windows nil)
#+end_src

Toggle wrapping text at the 80th character
#+begin_src emacs-lisp
(setq default-fill-column 80)
#+end_src

Move around lines based on how they displayed
#+begin_src emacs-lisp
(setq line-move-visual t)

#+end_src

Maximum line width
#+begin_src emacs-lisp
(setq-default fill-column 80)

#+end_src

Highlight current line
#+begin_src emacs-lisp
(global-hl-line-mode t)

#+end_src

Zusammengehörende Klammern hervorhebne
#+begin_src emacs-lisp
(show-paren-mode t)
#+end_src

Continue wrapped words at whitespace, rather than in the middle of a word.
#+begin_src emacs-lisp
(setq-default word-wrap t)

#+end_src

#+begin_src emacs-lisp
;(setq-default smartparense-mode t)
 (setq-default  display-line-numbers-type 'relative)
#+end_src
*** Auto-Dim-Buffer
[[https://github.com/mina86/auto-dim-other-buffers.el][Auto-Dim-Other-Buffers]] is a global minor mode which makes windows without focus less prominent.
#+begin_src emacs-lisp
;;; Package

;;; Code:
(use-package auto-dim-other-buffers
  :config
  (require 'auto-dim-other-buffers)
  (add-hook 'after-init-hook (lambda ()
    (when (fboundp 'auto-dim-other-buffers-mode)
    (auto-dim-other-buffers-mode t)))))

#+end_src

*** Rainbow-Delimiters
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :defer t
  :hook
  (prog-mode . rainbow-delimiters-mode))

#+end_src

*** Info-Color
#+begin_src emacs-lisp
(use-package info-colors
  :defer t
  :commands (info-colors-fontify-node))
  (add-hook 'Info-selection-hook 'info-colors-fontify-node)
  (add-hook 'Info-mode-hook #'mixed-pitch-mode)

#+end_src

*** Bufler
[[https://github.com/alphapapa/bufler.el][Bufler]] is like a butler for your buffers, presenting them to you in an organized way based on your instructions.
#+begin_src emacs-lisp
(use-package bufler)
(add-to-list 'evil-emacs-state-modes 'bufler-mode)
(add-to-list 'evil-emacs-state-modes 'bufler-tabs-mode)
(add-to-list 'evil-emacs-state-modes 'bufler-list-mode)
#+end_src

*** Buffer-Flip
[[https://github.com/killdash9/buffer-flip.el][Buffer-Flip]] makes it possible to switch between recent buffers, with an emphasis on minimizing keystrokes.
#+begin_src emacs-lisp
(use-package buffer-flip
  :config
  (setq buffer-flip-skip-patterns
        '("^\\*helm\\b"
          "^\\*swiper\\*$")))
#+end_src

*** Create Scratch Buffer
Create a scratch buffer.
#+begin_src emacs-lisp
(defun semacs/generate-scratch-buffer ()
  "Create and switch to a temporary scratch buffer with a random
       name."
  (interactive)
  (switch-to-buffer (make-temp-name "scratch-")))

#+end_src
*** Vdiff
Vdiff let's one compare buffers or files.
#+begin_src emacs-lisp
(use-package vdiff
  :config
  ; This binds commands under the prefix when vdiff is active.
  (define-key vdiff-mode-map (kbd "C-c") vdiff-mode-prefix-map))
#+end_src

#+RESULTS:
: t

*** Window split
#+begin_src emacs-lisp
(defun semacs/window-split()
(interactive)
;;(evil-window-split)
(switch-to-buffer-other-window "*test*")
(dired "~/")
    )
#+end_src

#+RESULTS:
: saa/window-split
*** Kill-All-Buffers
#+begin_src emacs-lisp
(defun nuke-all-buffers ()
  (interactive)
  (mapcar 'kill-buffer (buffer-list))
  (delete-other-windows))

(global-set-key (kbd "C-x K") 'nuke-all-buffers)
#+end_src


** Minibuffer-Config
*** Built-In
#+begin_src emacs-lisp
(setq enable-recursive-minibuffers t)                                       ;Allow for minibuffer-ception. Sometimes we need another minibuffer command while we're in the minibuffer.
(setq echo-keystrokes 0.02)                                                 ;    Show current key-sequence in minibuffer ala 'set showcmd' in vim. Any feedback after typing is better UX than no feedback at all.
(setq resize-mini-windows 'grow-only)                                       ;Expand the minibuffer to fit multi-line text displayed in the echo-area. This doesn't look too great with direnv, however...
(fset #'yes-or-no-p #'y-or-n-p)                                                   ;Typing yes/no is obnoxious when y/n will do
(setq minibuffer-prompt-properties
  '(read-only t intangible t cursor-intangible t face minibuffer-prompt))   ;Try really hard to keep the cursor from getting stuck in the read-only prompt portion of the minibuffer.
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
(minibuffer-depth-indicate-mode)
(savehist-mode 1)                                                            ;Save minibuffer history
(setq-default history-length 1000)

#+end_src

*** Which-Key
[[https://github.com/justbur/emacs-which-key][Which-Key]] is a minor mode for Emacs that displays the key bindings following your currently entered incomplete command (a prefix) in a popup.
#+begin_src emacs-lisp
(use-package which-key
  :init
  (setq which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-max-display-columns 6
        which-key-min-display-lines 4
        which-key-side-window-slot -10)
  (setq which-key-max-description-length 27)
  (setq which-key-allow-evil-operators t)
  (setq which-key-show-operator-state-maps nil)
  :custom
  (which-key-setup-minibuffer)
  (which-key-setup-side-window-bottom)
  (which-key-enable-extended-define-key t)
  (which-key-sort-order 'which-key-key-order-alpha)
  (which-key-side-window-max-width 0.53)
  (which-key-idle-delay 0.05)
  :config
  (which-key-mode)
  (which-key-setup-minibuffer))
#+end_src

*** Prescient
prescient is a library for intelligent sorting and filtering in various contexts. Don't know
#+begin_src emacs-lisp
(use-package prescient
  :config
  ;; Remember usage statistics across Emacs sessions.
  (prescient-persist-mode +1)
  ;; The default settings seem a little forgetful to me. Let's try
  ;; this out.
  (setq prescient-history-length 1000))
#+end_src

** Cursor-Config
*** Built-In
Disable blinking cursor in can cause freezing.
#+begin_src emacs-lisp
(blink-cursor-mode -1)

#+end_src

Don't blink the paren matching the one at point, it's too distracting.
#+begin_src emacs-lisp
(setq blink-matching-paren nil)

#+end_src

Disable cursor stretching to fit wide characters, it is disorienting, especially for tabs.
#+begin_src emacs-lisp
(setq x-stretch-cursor nil)

#+end_src

*** Remember-Cursor
#+begin_src emacs-lisp
(setq save-place-file
      (expand-file-name "saveplace" semacs-cache-dir))
(if (version<= emacs-version "25.1")
    (progn
      (setq-default save-place t)
      (require 'saveplace))
  (save-place-mode 1))

#+end_src

** Scrolling-Config
