.config/emacs/Semacs/config.el

(setq hscroll-margin 2)
(setq      hscroll-step 1)
      ;; Emacs spends too much effort recentering the screen if you scroll the
      ;; cursor more than N lines past window edges (where N is the settings of
      ;; `scroll-conservatively'). This is especially slow in larger files
      ;; during large-scale scrolling commands. If kept over 100, the window is
      ;; never automatically recentered.
(setq      scroll-conservatively 101)
(setq      scroll-margin 0)
(setq      scroll-preserve-screen-position t)
      ;; Reduce cursor lag by a tiny bit by not auto-adjusting `window-vscroll'
      ;; for tall lines.
(setq      auto-window-vscroll nil)
      ;; mouse
(setq      mouse-wheel-scroll-amount '(2 ((shift) . hscroll)))
(setq      mouse-wheel-scroll-amount-horizontal 2)

(setq confirm-kill-emacs 'y-or-n-p)

(use-package restart-emacs)

;; http://iqbalansari.github.io/blog/2014/12/07/automatically-create-parent-directories-on-visiting-a-new-file-in-emacs/
(defun my-create-non-existent-directory ()
  (let ((parent-directory (file-name-directory buffer-file-name)))
    (when (and (not (file-exists-p parent-directory))
               (y-or-n-p (format "Directory `%s' does not exist! Create it?" parent-directory)))
      (make-directory parent-directory t))))

(add-to-list 'find-file-not-found-functions 'my-create-non-existent-directory)

(use-package dashboard
   :config
    (dashboard-setup-startup-hook)

    (setq dashboard-startup-banner (expand-file-name "apperance-dashboard-lion.png" semacs-emacs-dir))
    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
    ;(setq dashboard-startup-banner 2)
;; TEST
    (defun dashboard-insert-custom (list-size)
    (insert "Custom text"))
    (add-to-list 'dashboard-item-generators  '(custom . dashboard-insert-custom))
    (add-to-list 'dashboard-items '(custom) t)

;; Edits
    (setq dashboard-banner-logo-title "Welcome to Semacs!")
    (setq dashboard-init-info "Your pain is the breaking of the shell that encloses your understanding.")
    (setq dashboard-show-shortcuts nil)
    ;(setq dashboard-startup-banner 'official)
    ;; Content is not centered by default. To center, set
    (setq dashboard-center-content t)
    (setq dashboard-set-init-info t)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-navigator t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-items '((recents . 10)
                            (projects . 5)
                            (bookmarks  . 5)
                            (agenda    . 5))))

(provide 'apperance-dashboard)
;;;Dashboard in Emacsclient
;;;This setting ensures that emacsclient always opens on dashboard rather than scratch.
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))

(use-package projectile
  :config
  (projectile-global-mode 1)
  (projectile-mode +1)
  (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map))

(use-package helm-projectile
  :config
  (helm-projectile-on))

(use-package deft
      :after org
      :bind
    ("C-c n d" . deft)
      :custom
      (deft-recursive t)
      (deft-use-filter-string-for-filename t)
      (deft-default-extension "org")
      (deft-directory "~/Org/"))

(setq dired-guess-shell-alist-user '(("" "xdg-open")))
;(define-key dired-mode-map "c" 'find-file)
;; Also auto refresh dired, but be quiet about it
(setq global-auto-revert-non-file-buffers t)
(setq auto-revert-verbose nil)

(use-package dired-single)

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package dired+)

(use-package dired-open
  :config
  ;; Doesn't work as expected!
  ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
  (setq dired-open-extensions '(("png" . "feh")
                                ("mkv" . "mpv"))))

(use-package dired-hide-dotfiles
  :config
  (dired-hide-dotfiles-mode)
  (define-key dired-mode-map "." 'dired-hide-dotfiles-mode))
;;; Kill all dired buffers
    (defun kill-all-dired-buffers ()
      "Kill all dired buffers."
      (interactive)
      (save-excursion
        (let ((count 0))
          (dolist (buffer (buffer-list))
            (set-buffer buffer)
            (when (equal major-mode 'dired-mode)
              (setq count (1+ count))
              (kill-buffer buffer)))
          (message "Killed %i dired buffer(s)." count))))

;;; Kill dired buffer
    (defun kill-dired-buffers ()
	 (interactive)
	 (mapc (lambda (buffer)
           (when (eq 'dired-mode (buffer-local-value 'major-mode buffer))
             (kill-buffer buffer)))
         (buffer-list)))

(setq dired-find-file-other-buffer t)

;;; dired subtree
(use-package dired-subtree
:config
(setq dired-subtree-use-backgrounds nil)
  (let ((map dired-mode-map))
    (define-key map (kbd "<tab>") #'dired-subtree-toggle)
    (define-key map (kbd "<C-tab>") #'dired-subtree-cycle)
    (define-key map (kbd "<backtab>") #'dired-subtree-remove))
) ; S-TAB

(use-package neotree
  :init
  (require 'neotree)
 :config
   (setq neo-autorefresh nil)
   (setq neo-window-width 45)
   (setq neo-theme (if (display-graphic-p) 'icons 'arrow))
   (setq neo-smart-open t))
(provide 'init-neotree)
(global-set-key [f8] 'neotree)

(evil-define-key 'normal neotree-mode-map (kbd "TAB") 'neotree-enter)
(evil-define-key 'normal neotree-mode-map (kbd "x") 'neotree-quick-look)
(evil-define-key 'normal neotree-mode-map (kbd "q") 'neotree-hide)
(evil-define-key 'normal neotree-mode-map (kbd "RET") 'neotree-enter)
(evil-define-key 'normal neotree-mode-map (kbd "g") 'neotree-refresh)
(evil-define-key 'normal neotree-mode-map (kbd "n") 'neotree-next-line)
(evil-define-key 'normal neotree-mode-map (kbd "p") 'neotree-previous-line)
(evil-define-key 'normal neotree-mode-map (kbd "A") 'neotree-stretch-toggle)
(evil-define-key 'normal neotree-mode-map (kbd "h") 'neotree-hidden-file-togglf)

(defun seamacs/rename-current-buffer-file ()
  "Renames current buffer and file it is visiting."
  (interactive)
  (let ((name (buffer-name))
        (filename (buffer-file-name)))
    (if (not (and filename (file-exists-p filename)))
        (error "Buffer '%s' is not visiting a file!" name)
      (let ((new-name (read-file-name "New name: " filename)))
        (if (get-buffer new-name)
            (error "A buffer named '%s' already exists!" new-name)
          (rename-file filename new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil)
          (message "File '%s' successfully renamed to '%s'"
                   name (file-name-nondirectory new-name)))))))

(defun semacs/visit-config.org ()
  (interactive)
  (find-file (expand-file-name "config.org" user-emacs-directory)))

(defun semacs/visit-init.el ()
  (interactive)
  (find-file (expand-file-name "init.el" user-emacs-directory)))
