.config/emacs/Semacs/config.org
*** Recentf
#+begin_src emacs-lisp
(use-package recentf
  ;; Keep track of recently opened files
  :commands recentf-open-files
  :config
  (defun semacs--recent-file-truename (file)
    (if (or (file-remote-p file nil t)
            (not (file-remote-p file)))
        (file-truename file)
      file))
    (setq recentf-filename-handlers
        '(;; Text properties inflate the size of recentf's files, and there is
          ;; no purpose in persisting them, so we strip them out.
          substring-no-properties
          ;; Resolve symlinks of local files. Otherwise we get duplicate
          ;; entries opening symlinks.
          semacs--recent-file-truename
          ;; Replace $HOME with ~, which is more portable, and reduces how much
          ;; horizontal space the recentf listing uses to list recent files.
          abbreviate-file-name)
        recentf-save-file (concat semacs-cache-dir "recentf")
        recentf-auto-cleanup 'never
        recentf-max-menu-items 0
        recentf-max-saved-items 200)
)
#+end_src

*** Openwith
#+begin_src emacs-lisp
(straight-use-package
 '(openwith :type git :host github :repo "jpkotta/openwith")
:config
    (when (require 'openwith nil 'noerror)
      (setq openwith-associations
            (list
             (list (openwith-make-extension-regexp
                    '("mpg" "mpeg" "mp3" "mp4"
                      "avi" "wmv" "wav" "mov" "flv"
                      "ogm" "ogg" "mkv"))
                   "vlc"
                   '(file))
             (list (openwith-make-extension-regexp
                    '("xbm" "pbm" "pgm" "ppm" "pnm"
                      "png" "gif" "bmp" "tif" "jpeg" "jpg"))
                   "geeqie"
                   '(file))
             (list (openwith-make-extension-regexp
                    '("doc" "xls" "ppt" "odt" "ods" "odg" "odp"))
                   "libreoffice"
                   '(file))
             '("\\.lyx" "lyx" (file))
             '("\\.chm" "kchmviewer" (file))
             (list (openwith-make-extension-regexp
                    '("pdf" "ps" "ps.gz" "dvi"))
                   "okular"
                   '(file))
             ))
      (openwith-mode 1))
 )
;; https://github.com/jpkotta/openwith/tree/1dc89670822966fab6e656f6519fdd7f01e8301a
#+end_src

*** Dmenu
#+begin_src emacs-lisp
(use-package dmenu
  :bind
    ("s-SPC" . 'dmenu))

(setq dmenu-cfg " | dmenu -i -l 20 -p .")

(defun dmenu-ag ()
  (interactive)

  (setq my_shell_output (shell-command-to-string (concat "ag . " dmenu-cfg)))
  (setq splitted (split-string my_shell_output ":"))

  (when (> (length splitted) 1)
    (find-file (car splitted))
    (goto-line (string-to-number (nth 1 splitted)))))

(defun dmenu-ag-in-file ()
  (interactive)

  (setq my_command (concat "ag . " buffer-file-name dmenu-cfg))
  (setq my_shell_output (shell-command-to-string my_command))
  (setq splitted (split-string my_shell_output ":"))

  (when (> (length splitted) 1)
    (goto-line (string-to-number (car splitted)))))

(defun dmenu-find-file (&optional dir)
  (interactive)

  (setq command (concat "ls -a" dmenu-cfg))
  (setq output (shell-command-to-string command))

  (when (> (length output) 1)
    (find-file (substring output 0 -1))))

(defun dmenu-switch-buffer (&optional dir)
  (interactive)

  (setq command (concat (format "%s" (counsel-ibuffer)) dmenu-cfg))
  (setq splitted (split-string my_shell_output ":"))

  (print command))
#+end_src

** File-Config
*** Built-In
#+begin_src emacs-lisp
;; Favor spaces over tabs. Pls dun h8, but I think spaces (and 4 of them) is a
;; more consistent default than 8-space tabs. It can be changed on a per-mode
;; basis anyway (and is, where tabs are the canonical style, like go-mode).
(setq-default indent-tabs-mode nil
              tab-width 4)

;; Only indent the line when at BOL or in a line's indentation. Anywhere else,
;; insert literal indentation.
(setq-default tab-always-indent nil)

;; Make `tabify' and `untabify' only affect indentation. Not tabs/spaces in the
;; middle of a line.
(setq tabify-regexp "^\t* [ \t]+")


;; This was a widespread practice in the days of typewriters. I actually prefer
;; it when writing prose with monospace fonts, but it is obsolete otherwise.
(setq sentence-end-double-space nil)

;; The POSIX standard defines a line is "a sequence of zero or more non-newline
;; characters followed by a terminating newline", so files should end in a
;; newline. Windows doesn't respect this (because it's Windows), but we should,
;; since programmers' tools tend to be POSIX compliant (and no big deal if not).
(setq require-final-newline t)

;; Default to soft line-wrapping in text modes. It is more sensibile for text
;; modes, even if hard wrapping is more performant.
(add-hook 'text-mode-hook #'visual-line-mode)

(delete-selection-mode t)                           ;Delete Selection mode lets you treat an Emacs region much like a typical text selection outside of Emacs.
#+end_src

*** Paredit
[[https://www.emacswiki.org/emacs/ParEdit][EmacsWiki: Par Edit]]
#+begin_src
    (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
    (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
    (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
    (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
    (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
    (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
    (add-hook 'scheme-mode-hook           #'enable-paredit-mode)
    ;;(add-hook 'org-mode-hook              #'enable-paredit-mode)
#+end_src

*** Smartparens
[[https://github.com/Fuco1/smartparens][GitHub - Fuco1/smartparens: Minor mode for Emacs that deals with parens pairs...]]
#+begin_src emacs-lisp
(use-package smartparens
  :init
  (smartparens-global-mode)
  :config
  (add-hook 'text-mode-hook 'smartparens-mode)
  (add-hook 'prog-mode-hook 'smartparens-mode))
#+end_src

*** Avy
[[https://github.com/abo-abo/avy][Avy]] a nice way to move around text.
#+begin_src emacs-lisp
(use-package avy
  :defer 4
  :commands (avy-goto-word-1))
#+end_src
*** Move-Line
#+begin_src emacs-lisp
(defun semacs/move-line-up ()
  "Move up the current line."
  (interactive)
  (transpose-lines 1)
  (forward-line -2)
  (indent-according-to-mode))

(defun semacs/move-line-down ()
  "Move down the current line."
  (interactive)
  (forward-line 1)
  (transpose-lines 1)
  (forward-line -1)
  (indent-according-to-mode))

(global-set-key (kbd "M-<down>") 'semacs/move-line-down)
(global-set-key (kbd "M-<up>") 'semacs/move-line-up)

#+end_src

*** Whitespace
#+begin_src emacs-lisp
(use-package whitespace
  :defer t
)

;Delete trailing whitespace in all modes. Except when editing Markdown,
;because it uses two trailing blanks as a signal to create a line break.
(add-hook 'before-save-hook '(lambda()
                              (when (not (or (derived-mode-p 'markdown-mode)))
                                (delete-trailing-whitespace))))


(defun saa/flyspell-and-whitespace-mode ()
  "Toggle `flyspell-mode' and `whitespace-mode'."
  (interactive)
  (if (derived-mode-p 'prog-mode)
      (flyspell-prog-mode)
    (flyspell-mode)
    (when flyspell-mode
      (flyspell-buffer)))
  (whitespace-mode 'toggle))

#+end_src

*** Umlaute
#+begin_src emacs-lisp
(use-package tex-smart-umlauts)
#+end_src



*** Ws-Butler
[[https://github.com/lewang/ws-butler][WS-Butler]] takes care of whitespace for you.
#+begin_src emacs-lisp
(use-package ws-butler
  ;; a less intrusive `delete-trailing-whitespaces' on save
  :config
  ;; ws-butler normally preserves whitespace in the buffer (but strips it from
  ;; the written file). While sometimes convenient, this behavior is not
  ;; intuitive. To the average user it looks like whitespace cleanup is failing,
  ;; which causes folks to redundantly install their own.
  (setq ws-butler-keep-whitespace-before-point nil))
#+end_src

** Search-Config
*** Ripgrep
#+begin_src emacs-lisp
(use-package ripgrep)
#+end_src

#+RESULTS:
** Undo-Config
*** Built-In
Undo-Limit
#+begin_src emacs-lisp
(setq undo-limit 80000000                          ;Raise undo-limit to 80Mb
      evil-want-fine-undo t )                      ;Be more granular


#+end_src

*** Undo-Fu
#+begin_src emacs-lisp
(use-package undo-fu
  :after undo-tree
  :config
  (add-hook 'prog-mode-hook 'undo-tree-mode)
  (add-hook 'text-mode-hook 'undo-tree-mode)
  (global-undo-tree-mode -1)
  (define-key evil-normal-state-map "u" 'undo-fu-only-undo)
  (define-key evil-normal-state-map "\C-r" 'undo-fu-only-redo))

#+end_src

