.config/emacs/Semacs/config.org
*** Undo-Fu-Session
#+begin_src emacs-lisp
(use-package undo-fu-session
  :config
  (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'"))
  (setq undo-fu-session-directory (concat semacs-cache-dir "undofu/"))
  (add-hook 'org-mode-hook
  (lambda ()
    (undo-fu-session-mode)))
)

#+end_src

*** Undo-Tree
#+begin_src emacs-lisp
(use-package undo-tree
  :config
  (global-undo-tree-mode)
  (unbind-key "M-_" undo-tree-map))

#+end_src

** Clipboard-Config
*** Built-In
Don't save duplicates to the kill-ring.
#+begin_src emacs-lisp
(setq kill-do-not-save-duplicates t)

#+end_src

Allow UTF or composed text from the clipboard, even in the terminal.
#+begin_src emacs-lisp
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

#+end_src

Basically make emacs play nicely with the rest of the system clipboard.
#+begin_src emacs-lisp
(setq x-select-enable-clipboard t)

#+end_src

After mouse selection in X11, you can pate by `yanking´ into emacs.
#+begin_src emacs-lisp
(setq x-select-enable-primary t)

#+end_src

The Windows clipboard could be in a wider encoding than utf-8.
#+begin_src emacs-lisp
(unless IS-WINDOWS
  (setq selection-coding-system 'utf-8)) ; with sugar on top

#+end_src

*** Copy-Filename
#+begin_src emacs-lisp
(defun saa/copy-file-name-to-clipboard ()
  "Copy the current buffer file name to the clipboard."
  (interactive)
  (let ((filename (if (equal major-mode 'dired-mode) default-directory (buffer-file-name))))
    (when filename
      (kill-new filename)
      (message "Copied buffer file name '%s' to the clipboard." filename))))


#+end_src
*** Clipmon
[[https://github.com/bburns/clipmon][Clipmon]] is a clipboard monitor - it watches the system clipboard and can automatically insert any new text into the current location in Emacs.
#+begin_src emacs-lisp
(use-package clipmon
  :init
  (add-to-list 'after-init-hook 'clipmon-mode-start))

#+end_src

*** Browse-Kill-Ring
[[https://github.com/browse-kill-ring/browse-kill-ring][Browser-Kill-Ring]] makes it possible to look through everything you've killed recently
#+begin_src emacs-lisp
(use-package browse-kill-ring
  :config
  (setq browse-kill-ring-highlight-inserted-item t
        browse-kill-ring-highlight-current-entry nil
        browse-kill-ring-show-preview t)
)

#+end_src

*** Unicode-Escape
[[https://github.com/kosh04/unicode-escape.el][Unicode-Escape]] makes Emacs request UTF-8 first when pasting stuff.
#+begin_src emacs-lisp
(use-package unicode-escape
  :init
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
(set-language-environment "UTF-8")
#+end_src

*** Clipetty
[[https://github.com/spudlyo/clipetty][Clipetty]] is a minor mode for terminal (TTY) users that sends text that you kill in Emacs to your Operating System's clipboard.
#+begin_src emacs-lisp
(use-package clipetty
:hook (after-init . global-clipetty-mode))
#+end_src
*** Yank-Pop
[[https://karthinks.com/software/a-better-yank-pop-binding/][A better yank-pop binding | Karthinks]]
#+begin_src emacs-lisp
(defun my/consult-yank-or-yank-pop (&optional arg)
  "Call `consult-yank'. If called after a yank, call `yank-pop' instead."
  (interactive "*p")
  (if (eq last-command 'yank)
      (yank-pop arg)
    (consult-yank)))
#+end_src
** Completion-Config
*** Company
[[https://company-mode.github.io/][Company]] is a modular completion framework. Modules for retrieving completion candidates are called backends, modules for displaying them are frontends.
#+begin_src emacs-lisp
(use-package company
:config
(setq company-selection-wrap-around t
      company-idle-delay 0.5
      company-minimum-prefix-length 2
      company-show-numbers t)
(add-hook 'evil-normal-state-entry-hook #'company-abort) ;; make aborting less annoying.
;===========================================
(company-tng-configure-default)
(global-company-mode t)
)


(use-package company-php
  :defer
  :after company)
#+end_src

*** Abbreviations
[[https://www.emacswiki.org/emacs/AbbrevMode][EmacsWiki: Abbrev Mode]]
#+begin_src emacs-lisp
(setq save-abbrevs 'silent)        ;; save abbrevs when files are saved
(setq-default abbrev-mode t)
(load "~/Coding/elisp/Semacs/snippets/semacs-abbrev.el")

#+end_src

*** Yasnippet
[[https://github.com/joaotavora/yasnippet][GitHub - joaotavora/yasnippet: A template system for Emacs]]
#+begin_src emacs-lisp
(use-package yasnippet
  :init
  (yas-global-mode)
  :config
    ;(setq yas-snippet-dirs (concat semacs-emacs-dir "snippets"))
    ;(setq yas-snippet-dirs (expand-file-name "snippets" semacs-emacs-dir))
    (setq yas-snippet-dirs '("~/.dotfiles/.config/emacs/Semacs/snippets"))
    (yas-global-mode 1)
    (use-package yasnippet-snippets)
    (yas-reload-all))


(define-key yas-minor-mode-map (kbd "<tab>") nil)
(define-key yas-minor-mode-map (kbd "TAB") nil)
(define-key yas-minor-mode-map (kbd "<C-tab>") 'yas-expand)

#+end_src

*** Yankpad
[[https://kungsgeten.github.io/yankpad.html][Yankpad]]
#+begin_example
(use-package yankpad
  :ensure t
  :defer
  :init
  (setq yankpad-file (org-relative-file "Templates/yankpad.org"))
  :config
  (bind-key "C-p y m" 'yankpad-map)
  (bind-key "C-p y e" 'yankpad-expand))

  #+end_example
*** Insert-Date
insert date
#+begin_src emacs-lisp
(defun seamacs/today (&optional arg)
"Insert today's date.

A prefix ARG specifies how many days to move;
negative means previous day.

If region selected, parse region as today's date pivot."
  (interactive "P")
  (let ((date (if (use-region-p)
                  (ts-parse (buffer-substring-no-properties (region-beginning) (region-end)))
                (ts-now)))
        (arg (or arg 0)))
    (if (use-region-p)
        (delete-region (region-beginning) (region-end)))
    (insert (ts-format "%A, %B %e, %Y" (ts-adjust 'day arg date)))))

#+end_src

*** Insert-File-Name
Take current filename (word separated by dash) as heading.
#+begin_src emacs-lisp
(defun semacs/insert-filename-as-heading ()
  "Take current filename (word separated by dash) as heading."
  (interactive)
  (insert
   (capitalize
    (replace-regexp-in-string "-" " " (file-name-sans-extension (buffer-name))))))
#+end_src

*** Academic-Phrases
[[https://github.com/nashamri/academic-phrases][GitHub - nashamri/academic-phrases: Bypass that mental block when writing you...]]
might get stuck trying to find the right phrase that captures your intention. This package tries to alleviate that problem by presenting you with a list of phrases organized by the topic or by the paper section that you are writing. This package has around 600 phrases so far.
#+begin_src emacs-lisp
(use-package academic-phrases)

#+end_src

*** Lorem-Ipsum
[[https://github.com/jschaf/emacs-lorem-ipsum][GitHub - jschaf/emacs-lorem-ipsum: Add lorem ipsum filler text to Emacs]]
Add filler lorem ipsum text to Emacs
#+begin_src emacs-lisp
(use-package lorem-ipsum)

#+end_src

** Spell-Settings
*** Flycheck
#+begin_src emacs-lisp
(use-package flycheck
  :after org
  :hook
  (org-src-mode . disable-flycheck-for-elisp)
  :custom
  (flycheck-emacs-lisp-initialize-packages t)
  (flycheck-display-errors-delay 0.1)
  :config
  (global-flycheck-mode)
  (flycheck-set-indication-mode 'left-margin)

  (defun disable-flycheck-for-elisp ()
    (setq-local flycheck-disabled-checkers '(emacs-lisp-checkdoc)))

  (add-to-list 'flycheck-checkers 'proselint)
  (setq-default flycheck-disabled-checkers '(haskell-stack-ghc)))

#+end_src

*** Flycheck-Inline
#+begin_src emacs-lisp
(use-package flycheck-inline
  :config (global-flycheck-inline-mode))

#+end_src

*** Flyspell-Correct
#+begin_src emacs-lisp
(use-package flyspell-correct
  :after flyspell
  :bind (:map flyspell-mode-map ("C-;" . flyspell-correct-wrapper)))

;  :init
 ; (global-flycheck-mode t))

  ;(add-hook 'text-mode-hook 'flyspell-mode)
  ;(add-hook 'prog-mode-hook 'flyspell-prog-mode)

#+end_src

*** Flyspell with Whitespace
#+begin_src emacs-lisp
(defun saa/flyspell-and-whitespace-mode ()
  "Toggle `flyspell-mode' and `whitespace-mode'."
  (interactive)
  (if (derived-mode-p 'prog-mode)
      (flyspell-prog-mode)
    (flyspell-mode)
    (when flyspell-mode
      (flyspell-buffer)))
  (whitespace-mode 'toggle))

(global-set-key (kbd "<f9>") #'saa/flyspell-and-whitespace-mode)

#+end_src

*** LSP-Grammarly
#+begin_src
(straight-use-package
 '(lsp-grammarly :type git :host github :repo "emacs-grammarly/lsp-grammarly"
  :hook (text-mode . (lambda ()
                       (require 'lsp-grammarly)
                       (lsp)))))  ; or lsp-deferred

#+end_src

*** Auto-Dictionary
;#+begin_src emacs-lisp
(use-package auto-dictionary
  :config
  (add-hook 'flyspell-mode-hook (lambda () (auto-dictionary-mode 1))))

;#+end_src

#+RESULTS:
: t

** Save-Settings
