.config/emacs/Semacs/config.org
*** Built-In
As a buffer is unsaved, backups create copies once, when the file is first written, and never again until it is killed and reopened. This is better suited to version control, and I don't want world-readable copies of potentially sensitive material floating around our filesystem.
#+begin_src emacs-lisp
(setq create-lockfiles nil                                            ; Don't generate backups or lockfiles. While auto-save maintains a copy so long
      make-backup-files nil
      ;; But in case the user does enable it, some sensible defaults:
      version-control t     ; number each backup file
      backup-by-copying t   ; instead of renaming current file (clobbers links)
      delete-old-versions t ; clean up after itself
      kept-old-versions 5
      kept-new-versions 5
      backup-directory-alist (list (cons "." (concat semacs-cache-dir "backup/")))
      tramp-backup-directory-alist backup-directory-alist)

(setq vc-follow-symlinks t)                                           ; Resolve symlinks when opening files, so that any operations are conducted from the file's true directory (like `find-file').
;(setq find-file-visit-trueme t)   ; Does not work with org-roam
(setq find-file-suppress-same-file-warnings t)                        ; Disable the warning "X and Y are the same file". It's fine to ignore this warning as it will redirect you to the existing buffer anyway.
#+end_src

But turn on auto-save, so we have a fallback in case of crashes or lost data. Use `recover-file' or `recover-session' to recover them.
#+begin_src emacs-lisp
(setq auto-save-default t
      ;; Don't auto-disable auto-save after deleting big chunks. This defeats
      ;; the purpose of a failsafe. This adds the risk of losing the data we
      ;; just deleted, but I believe that's VCS's jurisdiction, not ours.
      auto-save-include-big-deletions t
      ;; Keep it out of `semacs-emacs-dir' or the local directory.
      auto-save-list-file-prefix (concat semacs-cache-dir "autosave/")
      tramp-auto-save-directory  (concat semacs-cache-dir "tramp-autosave/")
      auto-save-file-name-transforms
      (list (list "\\`/[^/]*:\\([^/]*/\\)*\\([^/]*\\)\\'"
                  ;; Prefix tramp autosaves to prevent conflicts with local ones
                  (concat auto-save-list-file-prefix "tramp-\\2") t)
            (list ".*" auto-save-list-file-prefix t)))
#+end_src

*** Autosave
To avoid file system clutter we put all auto saved files in a single directory.
#+begin_example

(defvar emacs-autosave-directory
  (concat user-emacs-directory "autosaves/")
  "This variable dictates where to put auto saves. It is set to a
  directory called autosaves located wherever your .emacs.d/ is
  located.")

;; Sets all files to be backed up and auto saved in a single directory.
(setq backup-directory-alist
      `((".*" . ,emacs-autosave-directory))
      auto-save-file-name-transforms
      `((".*" ,emacs-autosave-directory t)))
#+end_example

*** Super-Save
#+begin_src emacs-lisp
(use-package super-save
  :config
  (super-save-mode +1))

;; add integration with ace-window

(add-to-list 'super-save-triggers 'ace-window)
;; save on find-file
(add-to-list 'super-save-hook-triggers 'find-file-hook)

#+end_src

*** Magit
#+begin_src emacs-lisp
(use-package magit
  :commands magit-file-delete
  :init
  (setq magit-auto-revert-mode nil)  ; we do this ourselves further down
  ;; Must be set early to prevent ~/.emacs.d/transient from being created
  :config

  (setq transient-default-level 5
        magit-diff-refine-hunk t ; show granular diffs in selected hunk
        ;; Don't autosave repo buffers. This is too magical, and saving can
        ;; trigger a bunch of unwanted side-effects, like save hooks and
        ;; formatters. Trust the user to know what they're doing.
        magit-save-repository-buffers nil
        ;; Don't display parent/related refs in commit buffers; they are rarely
        ;; helpful and only add to runtime costs.
        magit-revision-insert-related-refs nil)
)
#+end_src

*** Diff-Hl
 highlights changed-and-uncommitted lines when programming.
#+begin_src emacs-lisp
(use-package diff-hl
  :config
  (add-hook 'prog-mode-hook 'turn-on-diff-hl-mode)
  (add-hook 'vc-dir-mode-hook 'turn-on-diff-hl-mode))

#+end_src

** Convert-Settings
*** Markdown-to-Org
Convert the current buffer's content from markdown to orgmode format and save it with the current buffer's file name but with .org extension.
#+begin_src emacs-lisp
 (defun semacs/markdown-convert-buffer-to-org ()
    "Convert the current buffer's content from markdown to orgmode format and save it with the current buffer's file name but with .org extension."
    (interactive)
    (shell-command-on-region (point-min) (point-max)
                             (format "pandoc -f markdown -t org -o %s"
                                     (concat (file-name-sans-extension (buffer-file-name)) ".org"))))
#+end_src

*** Pandoc
#+begin_src emacs-lisp
(use-package pandoc-mode)

(use-package ox-pandoc
  :after org)
;; default options for all output formats
;(setq org-pandoc-options '((standalone . _)))
;; cancel above settings only for 'docx' format
;(setq org-pandoc-options-for-docx '((standalone . nil)))
;; special settings for beamer-pdf and latex-pdf exporters
;(setq org-pandoc-options-for-beamer-pdf '((pdf-engine . "xelatex")))
;(setq org-pandoc-options-for-latex-pdf '((pdf-engine . "pdflatex")))
;; special extensions for markdown_github output
;(setq org-pandoc-format-extensions '(markdown_github+pipe_tables+raw_html))

;; open docx files in default application (ie msword)
(setq org-file-apps
      '(("\\.docx\\'" . default)
        ("\\.mm\\'" . default)
        ("\\.x?html?\\'" . default)
        ("\\.pdf\\'" . default)
        (auto-mode . emacs)))
#+end_src

** Remote-Settings
*** Tramp
Connect and open dired via a remote Machine via Sftp.
#+begin_src emacs-lisp
(require 'tramp)
(setq tramp-verbose 10)
(setq tramp-debug-buffer t)

(defun connect-remote ()
  "Connect to Ubuntu Server"
  (interactive)
  (dired "/sftp:ubuntu@192.168.188.39:~"))

#+end_src

SSH authentication with ZSH works with this snippet.
#+begin_src
(setq tramp-shell-prompt-pattern "^[^$>\n]*[#$%>] *\\(\[[0-9;]*[a-zA-Z] *\\)*")
#+end_src

** Research-Config
*** Define-Word
#+begin_src emacs-lisp
(use-package define-word
  :defer 5
)

#+end_src

*** Google-Translate
#+begin_src emacs-lisp
(use-package google-translate
  :custom
  (google-translate-backend-method 'curl)
  :config
   (defun google-translate--search-tkk () "Search TKK." (list 430675 2721866130)))

#+end_src

** Shell-Config
*** Better Shell
#+begin_src emacs-lisp
(use-package better-shell
    :bind (("C-;" . better-shell-shell)
           ("C-'" . better-shell-remote-open)))
#+end_src

*** Exec-Path
#+begin_src emacs-lisp
(setq exec-path (append exec-path '("/usr/local/bin")))
#+end_src

*** Exec-Path-From-Shell
Makes Emacs use the $PATH set up by the user's shell
#+begin_src emacs-lisp
(use-package exec-path-from-shell)
#+end_src

** Media-Config
*** Counsel-Spotify
[[https://github.com/Lautaro-Garcia/counsel-spotify][Counsel-Spotify]] control Spotify app through an Ivy interface.
=INFO:= Spotify needs to be running!
#+begin_src emacs-lisp
(setq counsel-spotify-client-id "ce31becb1af94921907671e4bfa7f558")
(setq counsel-spotify-client-secret "9433b011b7094b2b8c4eb0255b8249e3")
(use-package counsel-spotify
:config
(require 'counsel-spotify)
)

(defun counsel-spotify-format-play-linux (uri)
  "Tell Spotify app to play the given URI."
  (format "OpenUri 'string:%s'" uri))

#+end_src

