.config/emacs/Semacs/config.el

(setq create-lockfiles nil                                            ; Don't generate backups or lockfiles. While auto-save maintains a copy so long
      make-backup-files nil
      ;; But in case the user does enable it, some sensible defaults:
      version-control t     ; number each backup file
      backup-by-copying t   ; instead of renaming current file (clobbers links)
      delete-old-versions t ; clean up after itself
      kept-old-versions 5
      kept-new-versions 5
      backup-directory-alist (list (cons "." (concat semacs-cache-dir "backup/")))
      tramp-backup-directory-alist backup-directory-alist)

(setq vc-follow-symlinks t)                                           ; Resolve symlinks when opening files, so that any operations are conducted from the file's true directory (like `find-file').
;(setq find-file-visit-trueme t)   ; Does not work with org-roam
(setq find-file-suppress-same-file-warnings t)                        ; Disable the warning "X and Y are the same file". It's fine to ignore this warning as it will redirect you to the existing buffer anyway.

(setq auto-save-default t
      ;; Don't auto-disable auto-save after deleting big chunks. This defeats
      ;; the purpose of a failsafe. This adds the risk of losing the data we
      ;; just deleted, but I believe that's VCS's jurisdiction, not ours.
      auto-save-include-big-deletions t
      ;; Keep it out of `semacs-emacs-dir' or the local directory.
      auto-save-list-file-prefix (concat semacs-cache-dir "autosave/")
      tramp-auto-save-directory  (concat semacs-cache-dir "tramp-autosave/")
      auto-save-file-name-transforms
      (list (list "\\`/[^/]*:\\([^/]*/\\)*\\([^/]*\\)\\'"
                  ;; Prefix tramp autosaves to prevent conflicts with local ones
                  (concat auto-save-list-file-prefix "tramp-\\2") t)
            (list ".*" auto-save-list-file-prefix t)))

(use-package super-save
  :config
  (super-save-mode +1))

;; add integration with ace-window

(add-to-list 'super-save-triggers 'ace-window)
;; save on find-file
(add-to-list 'super-save-hook-triggers 'find-file-hook)

(use-package magit
  :commands magit-file-delete
  :init
  (setq magit-auto-revert-mode nil)  ; we do this ourselves further down
  ;; Must be set early to prevent ~/.emacs.d/transient from being created
  :config

  (setq transient-default-level 5
        magit-diff-refine-hunk t ; show granular diffs in selected hunk
        ;; Don't autosave repo buffers. This is too magical, and saving can
        ;; trigger a bunch of unwanted side-effects, like save hooks and
        ;; formatters. Trust the user to know what they're doing.
        magit-save-repository-buffers nil
        ;; Don't display parent/related refs in commit buffers; they are rarely
        ;; helpful and only add to runtime costs.
        magit-revision-insert-related-refs nil)
)

(use-package diff-hl
  :config
  (add-hook 'prog-mode-hook 'turn-on-diff-hl-mode)
  (add-hook 'vc-dir-mode-hook 'turn-on-diff-hl-mode))

(defun semacs/markdown-convert-buffer-to-org ()
   "Convert the current buffer's content from markdown to orgmode format and save it with the current buffer's file name but with .org extension."
   (interactive)
   (shell-command-on-region (point-min) (point-max)
                            (format "pandoc -f markdown -t org -o %s"
                                    (concat (file-name-sans-extension (buffer-file-name)) ".org"))))

(use-package pandoc-mode)

(use-package ox-pandoc
  :after org)
;; default options for all output formats
;(setq org-pandoc-options '((standalone . _)))
;; cancel above settings only for 'docx' format
;(setq org-pandoc-options-for-docx '((standalone . nil)))
;; special settings for beamer-pdf and latex-pdf exporters
;(setq org-pandoc-options-for-beamer-pdf '((pdf-engine . "xelatex")))
;(setq org-pandoc-options-for-latex-pdf '((pdf-engine . "pdflatex")))
;; special extensions for markdown_github output
;(setq org-pandoc-format-extensions '(markdown_github+pipe_tables+raw_html))

;; open docx files in default application (ie msword)
(setq org-file-apps
      '(("\\.docx\\'" . default)
        ("\\.mm\\'" . default)
        ("\\.x?html?\\'" . default)
        ("\\.pdf\\'" . default)
        (auto-mode . emacs)))

(require 'tramp)
(setq tramp-verbose 10)
(setq tramp-debug-buffer t)

(defun connect-remote ()
  "Connect to Ubuntu Server"
  (interactive)
  (dired "/sftp:ubuntu@192.168.188.39:~"))

(use-package define-word
  :defer 5
)

(use-package google-translate
  :custom
  (google-translate-backend-method 'curl)
  :config
   (defun google-translate--search-tkk () "Search TKK." (list 430675 2721866130)))

(use-package better-shell
    :bind (("C-;" . better-shell-shell)
           ("C-'" . better-shell-remote-open)))

(setq exec-path (append exec-path '("/usr/local/bin")))

(use-package exec-path-from-shell)

(setq counsel-spotify-client-id "ce31becb1af94921907671e4bfa7f558")
(setq counsel-spotify-client-secret "9433b011b7094b2b8c4eb0255b8249e3")
(use-package counsel-spotify
:config
(require 'counsel-spotify)
)

(defun counsel-spotify-format-play-linux (uri)
  "Tell Spotify app to play the given URI."
  (format "OpenUri 'string:%s'" uri))
