.config/emacs/Semacs/config.el

(use-package emmet-mode)
(add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
(add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.

(use-package elpy
    :init
    (add-to-list 'auto-mode-alist '("\\.py$" . python-mode))
    :bind (:map elpy-mode-map
	      ("<M-left>" . nil)
	      ("<M-right>" . nil)
;	      ("<M-S-left>" . elpy-nav-indent-shift-left)
;	      ("<M-S-right>" . elpy-nav-indent-shift-right)
	      ("M-." . elpy-goto-definition)
	      ("M-," . pop-tag-mark))
    :config
    (setq elpy-rpc-backend "jedi"))

(use-package python
  :mode ("\\.py" . python-mode)
  :config
  (setq python-indent-offset 4)
  (elpy-enable))

(use-package pyenv-mode
  :init
  ;(add-to-list 'exec-path "~/.pyenv/shims")
  ;(setenv "~/.pyenv/versions/")
  (setq exec-path (append exec-path '("~/.pyenv/bin")))
  :config
  (pyenv-mode)
  :bind
  ("C-x p e" . pyenv-activate-current-project))

(defun pyenv-activate-current-project ()
  "Automatically activates pyenv version if .python-version file exists."
  (interactive)
  (let ((python-version-directory (locate-dominating-file (buffer-file-name) ".python-version")))
    (if python-version-directory
        (let* ((pyenv-version-path (f-expand ".python-version" python-version-directory))
               (pyenv-current-version (s-trim (f-read-text pyenv-version-path 'utf-8))))
          (pyenv-mode-set pyenv-current-version)
          (message (concat "Setting virtualenv to " pyenv-current-version))))))

(use-package php-mode)

(use-package haskell-mode)
(require 'haskell-mode-autoloads)

(package-initialize)
(when (eq system-type 'gnu/linux)
(setq user-org-directory (concat (getenv "HOME") "/Org/"))
(setq org_notes (expand-file-name "zettelkasten/" user-org-directory))
(setq org_agenda (expand-file-name "zettelkasten/task.org" user-org-directory))
(setq org_bib (expand-file-name "zettelkasten/bibnotes.org" user-org-directory))
(setq org_export (expand-file-name "zettelkasten/org-export/" user-org-directory))
(setq zot_bib (expand-file-name "zettelkasten/MeineBibliothek.bib" user-org-directory))
)

;Quickly visit Zettelkasten
(defun saa/visit-roam-zettelkasten ()
  (interactive)
  (find-file "~/Org/zettelkasten/index.org"))

;Org-Settings
(use-package org
  :init
  (progn
    (setq org-directory user-org-directory)
    (setq org-log-done 'time)
    (setq org-completion-use-ido t))
  :config
    (setq org-return-follows-link t)              ;Open Links with =RET=
    (setq org-drawers (quote ("PROPERTIES" "CLOCKTABLE" "LOGBOOK" "CLOCK")))
    (setq org-startup-folded 'fold)
    (setq org-cycle-separator-lines 0)             ;Structure the collapsed view
    (setq org-support-shift-select t)
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-into-drawer t)
    (setq org-ellipsis " ")
    (setq org-startup-indented t)                  ;Indent according to section
    (setq org-startup-with-inline-images t)        ;Display images in-buffer by default
    (setq org-link-frame-setup
      '((file . find-file)))                       ;Open Org-Link in same buffer
    (setq org-src-tab-acts-natively t)
    (setq org-src-preserve-indentation t)
    (setq org-todo-keywords
      '((sequence "TODO" "FEEDBACK" "VERIFY" "CANCELLED" "NOTINUSE" "|" "DONE" "DELEGATED")))
    (setq org-todo-keyword-faces
      '(("TODO" :foreground "#7c7c75" :weight normal :underline t)
        ("FEEDBACK" :foreground "#9f7efe" :weight normal :underline t)
        ("VERIFY" :foreground "#0098dd" :weight normal :underline t)
        ("DONE" :foreground "#50a14f" :weight normal :underline t)
        ("NOTINUSE" :foreground "#50a14f" :weight normal :underline t)
        ("DELEGATED" :foreground "#B5123E" :weight normal :underline t)
        ("CANCELLED" :foreground "#ff6480" :weight normal :underline t)))
    (setq org-priority-faces
      '((65 :foreground "#e45649")
        (66 :foreground "#da8548")
        (67 :foreground "#0098dd"))))

;; Font size
(dolist (face '((org-level-1 . 1.1)
                (org-level-2 . 1.0)
                (org-level-3 . 1.0)
                (org-level-4 . 1.0)
                (org-level-5 . 1.0)
                (org-level-6 . 1.0)
                (org-level-7 . 1.0)
                (org-level-8 . 1.0)))
        (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

;;
(custom-theme-set-faces
  'user
  '(org-block ((t (:inherit fixed-pitch))))
  '(org-code ((t (:inherit (shadow fixed-pitch)))))
  '(org-document-info ((t (:foreground "dark orange"))))
  '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
  '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
  '(org-link ((t (:foreground "royal blue" :underline t))))
  '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
  '(org-property-value ((t (:inherit fixed-pitch))) t)
  '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
  '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
  '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 1.0))))
  '(org-verbatim ((t (:inherit (shadow fixed-pitch))))))

(use-package org-appear
  :defer t
  :straight (org-appear :type git :host github :repo "awth13/org-appear")
  :hook (org-mode . org-appear-mode)
  :init
  (setq org-appear-autoemphasis  t)
  ;; (setq org-appear-autolinks t)
  (setq org-appear-autosubmarkers t))

(setq org-confirm-babel-evaluate 'nil)             ; Don't ask before executing

(org-babel-do-load-languages
'org-babel-load-languages
'(
 (R . t)
   (dot . t)
   (js . t)
   ;(php . t)
   (emacs-lisp . t)
   (python . t)
   (latex . t)
   (shell . t)
  ))

;Org-Babel-Block-Setting
(setq org-src-fontify-natively t
      org-src-window-setup 'current-window         ;edit in current window
      org-src-strip-leading-and-trailing-blank-lines t
      org-src-preserve-indentation t               ; do not put two spaces on the left
      org-src-tab-acts-natively t
      org-src-preserve-indentation t)

(use-package org-rich-yank
  :defer 6)

(defun org-export-output-file-name-modified (orig-fun extension &optional subtreep pub-dir)
  (unless pub-dir
    (setq pub-dir "~/Org/org-export")
    (unless (file-directory-p pub-dir)
      (make-directory pub-dir)))
  (apply orig-fun extension subtreep pub-dir nil))
(advice-add 'org-export-output-file-name :around #'org-export-output-file-name-modified)

(straight-use-package
 '(org-exsty :type git :host github :repo "seansen/org-exsty")
;:config (setq org-exsty-directory "FUCK")
 )

(use-package org-fancy-priorities
  :after org
  :hook
    (org-mode . org-fancy-priorities-mode)
  :config
    (setq org-fancy-priorities-list '("\u2764" "\u2708" "\u2706" "test" "\u270e")))

(use-package helm-org-rifle)

(use-package org-noter)

;(use-package org-pdftools
;  :hook (org-mode . org-pdftools-setup-link))
