.config/emacs/Semacs/config.org
*** Org-Templates
#+begin_src emacs-lisp
;(defun transform-square-brackets-to-round-ones(string-to-transform)
;  "Transforms [ into ( and ] into ), other chars left unchanged."
;  (concat (mapcar #'(lambda (c) (if (equal c ?[) ?\( (if (equal c ?]) ?\) c))) ;string-to-transform)))

(setq org-capture-templates
      '(("t" "Aufgabe in tasks.org" entry (file+headline "~/projects/org/tasks.org" "Inbox")
         "* TODO %?")
        ("w" "Waiting For Reply (Mail)" entry (file+headline "~/projects/org/tasks.org" "Inbox")
         "* WAITING Antwort auf %a")
        ("m" "Aufgabe aus Mail" entry (file+headline "~/projects/org/tasks.org" "Inbox")
         "* TODO %? , Link: %a")
        ("z" "Zeiteintrag in tasks.org" entry (file+headline "~/projects/org/tasks.org" "Inbox")
         "* ZKTO %? \n  %i" :clock-in t :clock-resume t)
        ("c" "Contacts" entry (file "~/projects/org/contacts.org")
         "* %(org-contacts-template-name) \n :PROPERTIES: %(org-contacts-template-email) \n :BIRTHDAY: \n :END:")
        ("j" "Journal" entry (file+datetree "~/projects/org/journal.org")
         "* %?\nEntered on %U\n  %i")
        ("p" "password" entry (file "~/projects/org/passwords.gpg")
         "* %^{Title}\n  %^{PASSWORD}p %^{USERNAME}p")))

;; Automatische Anpassung des Links zu einer E-Mail.
;; Alle Mails werden im Folder 'Archive' gespeichert.
(add-hook 'org-capture-prepare-finalize-hook 'hs/search)
(defun hs/search ()
  (interactive)
  (goto-char 1)
  (replace-string "INBOX" "Archive"))
#+end_src

*** Org-Reload
#+begin_src emacs-lisp
(org-reload)
#+end_src
*** Org-Cliplink
A simple command that takes a URL from the clipboard and inserts an org-mode link with a title of a page found by the URL into the current buffer.
#+begin_src emacs-lisp
(use-package org-cliplink)
#+end_src

* Settings-to-Sort
** Ivy Counsel
#+begin_src emacs-lisp
(use-package ivy
  :config
  (ivy-mode 1)
  ;;(setq search-default-mode #'char-fold-to-regexp)
  (setq ivy-use-virtual-buffers t)
  (setq ivy-initial-inputs-alist nil)
  (setq enable-recursive-minibuffers t))

;Counsel is just ivy, but with a custom tailored UI for each specific situation.
(use-package counsel)

;Remember Commands that where uses
(use-package ivy-prescient
  :after counsel
  :config
  (ivy-prescient-mode 1)
  ;; Remember candidate frequencies across sessions
  (prescient-persist-mode 1)
  ;How many chosen candidates will be remembered
  (setq prescient-history-length 150)
  ;A multiplier applied to each frequent candidate each selection (default: 0.997)
  (setq prescient-frequency-decay 0.997)
  ;Threshold used for forgotten a command that isn't used frequently anymore (default: 0.5)
  (setq prescient-frequency-threshold 0.5)
  (setq prescient-filter-method '(literal regexp))
)

(use-package ivy-rich
  :after counsel
  :custom
  (ivy-virtual-abbreviate 'full
   ivy-rich-switch-buffer-align-virtual-buffer t
   ivy-rich-path-style 'abbrev)
  :config
  (ivy-set-display-transformer 'ivy-switch-buffer
                               'ivy-rich-switch-buffer-transformer)
  (ivy-rich-mode 1)) ;; this gets us descriptions in M-x.
#+end_src

** Helm
[[https://github.com/emacs-helm/helm][Helm]] is an Emacs framework for incremental completions and narrowing selections.
#+begin_src emacs-lisp
(use-package helm)
#+end_src

** Swiper
[[https://github.com/abo-abo/swiper][Swiper]] is a generic completion mechanism for Emacs.
#+begin_src emacs-lisp
(use-package swiper)
#+end_src

** Text-Hook
#+begin_src emacs-lisp
;(add-hook 'text-mode-hook 'smartparens-mode)
(add-hook 'text-mode-hook 'tex-smart-umlauts-mode)
#+end_src


** Program-Hooks
#+begin_src emacs-lisp
(add-hook 'prog-mode-hook 'linum-mode)
(add-hook 'prog-mode-hook 'visual-line-mode)
(add-hook 'prog-mode-hook 'show-paren-mode)
(add-hook 'prog-mode-hook 'hs-minor-mode)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
;(add-hook 'prog-mode-hook 'smartparens-mode)
(add-hook 'prog-mode-hook 'yas-global-mode)
(add-hook 'prog-mode-hook 'tex-smart-umlauts-mode)
#+end_src

* TEST
